---
kind: method
id: M:Autodesk.Revit.DB.View3D.SetRenderingSettings(Autodesk.Revit.DB.RenderingSettings)
zh: 三维视图、3d视图
source: html/42ce8cc3-8466-1f6a-bc5c-413a47a7332f.htm
---
# Autodesk.Revit.DB.View3D.SetRenderingSettings Method

**中文**: 三维视图、3d视图

Changes the rendering settings for this 3d view.

## Syntax (C#)
```csharp
public void SetRenderingSettings(
	RenderingSettings settings
)
```

## Parameters
- **settings** (`Autodesk.Revit.DB.RenderingSettings`) - The new rendering settings to be applied to this view.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null